FavMenu.org
#+OPTIONS: toc:t

* FavMenu & Menu Editor

	for Windows XP & 2K


** OVERVIEW

FavMenu is Windows OS enhancer and application launcher. It stores information about your favorite
folders and executables and let you quickly use your favorites within system dialogs (Open/Save,
Browse For Folder, Office2003 dialogs), Console (cmd.exe), Widows Explorer and Total Commander.

Format of the menu configuration file is compatibile with the Total Commander file manager directory
menu, and was originaly written to work as addon for this file manager. Almost all features of the
TC directory menu are supported, including plugins and pseudovariables. Furthermore, TC doesn¡¯t
need to be started.  If you don¡¯t use Total Commander Favmenu can be set to work with Windows
Explorer. This option will be automatically offered on first start-up if TC is not detected.

Menu Editor can be used to create, edit, delete and organise menu items. This is also complete
replacement of TC¡¯s internal directory menu editor witch adds many new options. It can be used
together with FavMenu or separate.

Both programs use the same ini file to store configuration, =Config.ini=.

You can see Favmenu screenshots [[http://www.r-moth.com/code/Favmenu/Screenshots.html][here]] and all supported dialogs [[http://www.r-moth.com/code/Favmenu/Dialogs.html][here]].


** INSTALLATION

You can run applications either by starting .exe or .ahk files. To run .ahk, you must have
[[http://www.autohotkey.com][AutoHotKey]] installed.  If you choose to run exe versions you can safely delete =*.ahk= files and
=\include= folder.

If you want Total Commander executable and its configuration file wincmd.ini to be automaticaly
recognised start FavMenu from within TC (not required if you installed TC normally or you have
COMMANDER_PATH environment variable set in the system).  Make sure you have something in the TC
directory menu before start using the program.


