FavMenu.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>FavMenu</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-05 22:06:57 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">FavMenu</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">FavMenu &amp; Menu Editor </a>
<ul>
<li><a href="#sec-1_1">OVERVIEW </a></li>
<li><a href="#sec-1_2">INSTALLATION </a></li>
<li><a href="#sec-1_3">FAVMENU  FEATURES </a></li>
<li><a href="#sec-1_4">MENU EDITOR FEATURES </a>
<ul>
<li><a href="#sec-1_4_1">NOTES </a></li>
</ul>
</li>
<li><a href="#sec-1_5">SCRIPT MERGING </a></li>
<li><a href="#sec-1_6">HISTORY: </a>
<ul>
<li><a href="#sec-1_6_1">V2.0 (18. September 2006) </a></li>
<li><a href="#sec-1_6_2">V1.1 (21. Avgust 2006) </a></li>
</ul>
</li>
<li><a href="#sec-1_7">TO DO </a></li>
<li><a href="#sec-1_8">ABOUT </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">FavMenu &amp; Menu Editor </h2>
<div class="outline-text-2" id="text-1">


<p>
for Windows XP &amp; 2K
</p>


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1">OVERVIEW </h3>
<div class="outline-text-3" id="text-1_1">


<p>
FavMenu is Windows OS enhancer and application launcher. It stores information about your favorite
folders and executables and let you quickly use your favorites within system dialogs (Open/Save,
Browse For Folder, Office2003 dialogs), Console (cmd.exe), Widows Explorer and Total Commander.
</p>
<p>
Format of the menu configuration file is compatibile with the Total Commander file manager directory
menu, and was originaly written to work as addon for this file manager. Almost all features of the
TC directory menu are supported, including plugins and pseudovariables. Furthermore, TC doesn¡¯t
need to be started.  If you don¡¯t use Total Commander Favmenu can be set to work with Windows
Explorer. This option will be automatically offered on first start-up if TC is not detected.
</p>
<p>
Menu Editor can be used to create, edit, delete and organise menu items. This is also complete
replacement of TC¡¯s internal directory menu editor witch adds many new options. It can be used
together with FavMenu or separate.
</p>
<p>
Both programs use the same ini file to store configuration, <code>Config.ini</code>.
</p>
<p>
You can see Favmenu screenshots <a href="http://www.r-moth.com/code/Favmenu/Screenshots.html">here</a> and all supported dialogs <a href="http://www.r-moth.com/code/Favmenu/Dialogs.html">here</a>.
</p>

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2">INSTALLATION </h3>
<div class="outline-text-3" id="text-1_2">


<p>
You can run applications either by starting .exe or .ahk files. To run .ahk, you must have
<a href="http://www.autohotkey.com">AutoHotKey</a> installed.  If you choose to run exe versions you can safely delete <code>*.ahk</code> files and
<code>\include</code> folder.
</p>
<p>
If you want Total Commander executable and its configuration file wincmd.ini to be automaticaly
recognised start FavMenu from within TC (not required if you installed TC normally or you have
COMMANDER_PATH environment variable set in the system).  Make sure you have something in the TC
directory menu before start using the program.
</p>

</div>

</div>
