FavMenu.org
** FAVMENU  FEATURES


- Favmenu supports several types of menu items.  Possible menu items are ( full TC compatibility):

    | MENU ITEM TYPE | COMMAND           | EXAMPLES                                                          |
    |----------------+-------------------+-------------------------------------------------------------------|
    | PATH           | cd path           | cd c:\program files     cd %SYSTEMROOT%\System32                  |
    | TC PLUGIN      | cd \\\plugin      | cd \\\Uninstaller       cd \\\Registry\HKEY_CURRENT_USER\Sofware  |
    | PSEUDOVARIABLE | cd %$var%\path    | cd %$DESKTOP%   cd %$PERSONAL%\My Pictures                        |
    | EXECUTABLE     | path_to_exectable | %$WINDOWS%\System32\Notepad.exe                                   |
    |                |                   | c:\boot.ini       /will be resolved via associations/             |
    |                |                   | %w%%s%%n%         /where w=C:\windows s=\system32  n=notepad.exe/ |
    |                |                   | %UTILS%\Edit Plus\Editplus.exe "c:\boot.ini" "c:\1.txt"           |
    

- Enter (on menu item)

  If
  * Open/Save, Browse For Folder or Office2003 dialog  is  active :
	     
    | SELECTION  | ACTION                        |
    |------------+-------------------------------|
    | PATH       | change the path in the dialog |
    | TC PLUGIN  | open or activate TC           |
    | EXECUTABLE | run the application or file   |

  * Console window is active :: change the current directory if path is selected or execute
       application / dos command
  * Any other window is active :: open or activate file manager for folders, launch an executable
    otherwise.


- CTRL + Enter (on menu item)

  Open Properties dialog with selected item. You can move around with buttons or you can use CTRL
  left & right arrow. You can change title, command and set icon.  Press Save on every individual
  item to save changes (title will change to notify you that save is complete).  It is much faster
  to use this dialog then TC's editor for single item change.

  If Properties dialog is open you can use Favmenu to change the currently displayed item by calling
  the menu and pressing <ENTER>. So favmenu can not be used until Properties dialog is closed.

- SHIFT + Enter (on menu item)

  Open selected item in new TC tab

- CTRL + SHIFT + Enter (on menu item)

  Send path of the selected item to the active window. 

- Setup dialog

  On first run, Setup dialog will search for TC location in the registry and if not found it will
  also try %COMMANDER_PATH% environment variable ( if not present in the system, this variable will
  be instantiated by TC privately) If setup can not find Total Commander it will use Windows
  Explorer as file manager. The default (sample) menu will be also created (menu.ini)

  If Favmenu didn¡¯t find your Total Commander, specify full paths to totalcmd.exe and wincmd.ini
  yourself.  In case you want to start TC with parameters, create link to the totalcmd.exe and edit
  link info as you desire. After that specify the path to the totalcmd.lnk instead totalcmd.exe.

  You can use environment variables to specify exe & ini location.

  You can later call this Setup dialog via the tray menu.

- Current directories,   Editor  &   ¡°Add current dir¡±  items

  If Total Ccommander is open, current left & right folders will be displayed at first 2
  positions. If they are the same only 1 will be visible.  If menu is called with TC active, this
  will not be displayed. You can use those items to fastly switch folders in dialogs to folders you
  carently use.

  Add current dir item works NOT only if TC is active. It is also supported in all system dialogs
  (except Office) and in Console. This will surely work for all hard disk folders but you may have
  problems with so called virtual folders since many of them don¡¯t have physical representation on
  the hard disk. You can¡¯t use Desktop folders for now, but that may be added in the future.

  Configure¡­ item (Editor) can also be set as a last item in the menu. This method is preferable to
  set the Editor, since you will not have double configuration enteries when using TCs original
  directory menu, because this item is not contained in the menu declaration. This also ensures that
  this item is always last in the menu.
	
  All 3 special items can be enabled/disabled via Setup dialog.

- Automatic Refresh

  Menu is refreshed on every call, so if you update your favorites in TC changes will be seen
  immediately.

- Office Dialogs

  Solid support to Office 2003 Open/Save dialogs (it doesn't work if ListView is focused) Make sure
  your carret is in the edit box next to the File Name and you will not have any problems.

- Console Support

  If cmd.exe is active window selecting path from FavMenu will change the path in the command
  line. If you select executable from the menu, it will be typed on the command line and
  executed. This allows console commands and applications to be added to the FavMenu.  For instance,
  you can create menu item: =dir /b | sort= 

  Menu items pointing to console commands (not applications) are NOT compatibile with Total
  Commander. If you need to run original TC directory menu, you will not be able to execute them.

  If you want to run executables with long file names in console, you must use quotes. This is not
  required for non-console usage.

  If you want to edit the line before posting it, you can use CTRL SHIFT ENTER.

  You can NOT run console commands from the system, only if console window is active. It is pretty
  pointless to run them from the system, since they are executed in the context of the current
  command line directory. The above command can be executed from the system by changing it to: =cmd
  /K dir /b | sort=

  In Setup->Integration tab you can set custom command to be executed after the directory is
  open. The default is set to dir /w /oGN so you are able to see contents of the folder after you
  change to it. You can change this to whatever you like (note that errors here will not be
  detected). If you want to display the folder in empty console window you can change this entery to
  cls & dir /w /oGN

- Icons 

  You can specify an icon to display beside menu item. Icons are 12x12 with first pixel holding
  transparent color. You have more then 100 icons included in the package for you private use. Use
  relative path names when setting icons if you want them to be portable.

- Pseudovariables

  Similar to environement variables, but has slightly different syntax (%$var%, instead %var%).
  Currently supported:
	

    | PSEUDOVARIABLE       | TYPICAL LOCATION                                                |
    |----------------------+-----------------------------------------------------------------|
    | APPDATA              | Application Data                                                |
    | COMMON_APPDATA       | All Users\Application Data                                      |
    | COMMON_DOCUMENTS     | All Users\Documents                                             |
    | DESKTOP              | C:\Documents and Settings\username\Desktop                      |
    | FONTS                | C:\Windows\Fonts                                                |
    | LOCAL_APPDATA        | Non roaming, user\Local Settings\Application Data               |
    | MYMUSIC              | My Music folder                                                 |
    | MYPICTURES           | My Pictures                                                     |
    | PERSONAL             | My Documents                                                    |
    | PROGRAM_FILES_COMMON | C:\Program Files\Common                                         |
    | PROGRAM_FILES        | C:\Program Files                                                |
    | PROGRAMS             | C:\Documents and Settings\username\Start Menu\Programs          |
    | RESOURCES            | %windir%\Resources\, For theme and other windows resources.     |
    | STARTMENU            | C:\Documents and Settings\username\Start Menu                   |
    | STARTUP              | C:\Documents and Settings\username\Start Menu\Programs\Startup. |
    | SYSTEM               | System Directory (usualy C:\WINDOWS\System32)                   |
    | WINDOWS              | Windows Directory (usualy c:\Windows)                           |
        
  TC NOTE: Not all above pseudovariables are currently supported but they may be in the future versions.


