FavMenu.html

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3">FAVMENU  FEATURES </h3>
<div class="outline-text-3" id="text-1_3">



<ul>
<li>
Favmenu supports several types of menu items.  Possible menu items are ( full TC compatibility):

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">MENU ITEM TYPE</th><th scope="col" class="left">COMMAND</th><th scope="col" class="left">EXAMPLES</th></tr>
</thead>
<tbody>
<tr><td class="left">PATH</td><td class="left">cd path</td><td class="left">cd c:\program files     cd %SYSTEMROOT%\System32</td></tr>
<tr><td class="left">TC PLUGIN</td><td class="left">cd \\\plugin</td><td class="left">cd \\\Uninstaller       cd \\\Registry\HKEY_CURRENT_USER\Sofware</td></tr>
<tr><td class="left">PSEUDOVARIABLE</td><td class="left">cd %$var%\path</td><td class="left">cd %$DESKTOP%   cd %$PERSONAL%\My Pictures</td></tr>
<tr><td class="left">EXECUTABLE</td><td class="left">path_to_exectable</td><td class="left">%$WINDOWS%\System32\Notepad.exe</td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">c:\boot.ini       <i>will be resolved via associations</i></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">%w%%s%%n%         <i>where w=C:\windows s=\system32  n=notepad.exe</i></td></tr>
<tr><td class="left"></td><td class="left"></td><td class="left">%UTILS%\Edit Plus\Editplus.exe "c:\boot.ini" "c:\1.txt"</td></tr>
</tbody>
</table>


</li>
</ul>

<ul>
<li>
Enter (on menu item)

<p>
If
</p><ul>
<li>
Open/Save, Browse For Folder or Office2003 dialog  is  active :

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">SELECTION</th><th scope="col" class="left">ACTION</th></tr>
</thead>
<tbody>
<tr><td class="left">PATH</td><td class="left">change the path in the dialog</td></tr>
<tr><td class="left">TC PLUGIN</td><td class="left">open or activate TC</td></tr>
<tr><td class="left">EXECUTABLE</td><td class="left">run the application or file</td></tr>
</tbody>
</table>


</li>
<li>
change the current directory if path is selected or execute
application / dos command
</li>
<li>
open or activate file manager for folders, launch an executable
otherwise.

</li>
</ul>
</li>
</ul>

<ul>
<li>
CTRL + Enter (on menu item)

<p>
Open Properties dialog with selected item. You can move around with buttons or you can use CTRL
left &amp; right arrow. You can change title, command and set icon.  Press Save on every individual
item to save changes (title will change to notify you that save is complete).  It is much faster
to use this dialog then TC's editor for single item change.
</p>
<p>
If Properties dialog is open you can use Favmenu to change the currently displayed item by calling
the menu and pressing &lt;ENTER&gt;. So favmenu can not be used until Properties dialog is closed.
</p>
</li>
<li>
SHIFT + Enter (on menu item)

<p>
Open selected item in new TC tab
</p>
</li>
<li>
CTRL + SHIFT + Enter (on menu item)

<p>
Send path of the selected item to the active window. 
</p>
</li>
<li>
Setup dialog

<p>
On first run, Setup dialog will search for TC location in the registry and if not found it will
also try %COMMANDER_PATH% environment variable ( if not present in the system, this variable will
be instantiated by TC privately) If setup can not find Total Commander it will use Windows
Explorer as file manager. The default (sample) menu will be also created (menu.ini)
</p>
<p>
If Favmenu didn¡¯t find your Total Commander, specify full paths to totalcmd.exe and wincmd.ini
yourself.  In case you want to start TC with parameters, create link to the totalcmd.exe and edit
link info as you desire. After that specify the path to the totalcmd.lnk instead totalcmd.exe.
</p>
<p>
You can use environment variables to specify exe &amp; ini location.
</p>
<p>
You can later call this Setup dialog via the tray menu.
</p>
</li>
<li>
Current directories,   Editor  &amp;   ¡°Add current dir¡±  items

<p>
If Total Ccommander is open, current left &amp; right folders will be displayed at first 2
positions. If they are the same only 1 will be visible.  If menu is called with TC active, this
will not be displayed. You can use those items to fastly switch folders in dialogs to folders you
carently use.
</p>
<p>
Add current dir item works NOT only if TC is active. It is also supported in all system dialogs
(except Office) and in Console. This will surely work for all hard disk folders but you may have
problems with so called virtual folders since many of them don¡¯t have physical representation on
the hard disk. You can¡¯t use Desktop folders for now, but that may be added in the future.
</p>
<p>
Configure¡­ item (Editor) can also be set as a last item in the menu. This method is preferable to
set the Editor, since you will not have double configuration enteries when using TCs original
directory menu, because this item is not contained in the menu declaration. This also ensures that
this item is always last in the menu.
</p>
<p>
All 3 special items can be enabled/disabled via Setup dialog.
</p>
</li>
<li>
Automatic Refresh

<p>
Menu is refreshed on every call, so if you update your favorites in TC changes will be seen
immediately.
</p>
</li>
<li>
Office Dialogs

<p>
Solid support to Office 2003 Open/Save dialogs (it doesn't work if ListView is focused) Make sure
your carret is in the edit box next to the File Name and you will not have any problems.
</p>
</li>
<li>
Console Support

<p>
If cmd.exe is active window selecting path from FavMenu will change the path in the command
line. If you select executable from the menu, it will be typed on the command line and
executed. This allows console commands and applications to be added to the FavMenu.  For instance,
you can create menu item: <code>dir /b | sort</code> 
</p>
<p>
Menu items pointing to console commands (not applications) are NOT compatibile with Total
Commander. If you need to run original TC directory menu, you will not be able to execute them.
</p>
<p>
If you want to run executables with long file names in console, you must use quotes. This is not
required for non-console usage.
</p>
<p>
If you want to edit the line before posting it, you can use CTRL SHIFT ENTER.
</p>
<p>
You can NOT run console commands from the system, only if console window is active. It is pretty
pointless to run them from the system, since they are executed in the context of the current
command line directory. The above command can be executed from the system by changing it to: <code>cmd   /K dir /b | sort</code>
</p>
<p>
In Setup-&gt;Integration tab you can set custom command to be executed after the directory is
open. The default is set to dir /w /oGN so you are able to see contents of the folder after you
change to it. You can change this to whatever you like (note that errors here will not be
detected). If you want to display the folder in empty console window you can change this entery to
cls &amp; dir /w /oGN
</p>
</li>
<li>
Icons 

<p>
You can specify an icon to display beside menu item. Icons are 12x12 with first pixel holding
transparent color. You have more then 100 icons included in the package for you private use. Use
relative path names when setting icons if you want them to be portable.
</p>
</li>
<li>
Pseudovariables

<p>
Similar to environement variables, but has slightly different syntax (%$var%, instead %var%).
Currently supported:
</p>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">PSEUDOVARIABLE</th><th scope="col" class="left">TYPICAL LOCATION</th></tr>
</thead>
<tbody>
<tr><td class="left">APPDATA</td><td class="left">Application Data</td></tr>
<tr><td class="left">COMMON_APPDATA</td><td class="left">All Users\Application Data</td></tr>
<tr><td class="left">COMMON_DOCUMENTS</td><td class="left">All Users\Documents</td></tr>
<tr><td class="left">DESKTOP</td><td class="left">C:\Documents and Settings\username\Desktop</td></tr>
<tr><td class="left">FONTS</td><td class="left">C:\Windows\Fonts</td></tr>
<tr><td class="left">LOCAL_APPDATA</td><td class="left">Non roaming, user\Local Settings\Application Data</td></tr>
<tr><td class="left">MYMUSIC</td><td class="left">My Music folder</td></tr>
<tr><td class="left">MYPICTURES</td><td class="left">My Pictures</td></tr>
<tr><td class="left">PERSONAL</td><td class="left">My Documents</td></tr>
<tr><td class="left">PROGRAM_FILES_COMMON</td><td class="left">C:\Program Files\Common</td></tr>
<tr><td class="left">PROGRAM_FILES</td><td class="left">C:\Program Files</td></tr>
<tr><td class="left">PROGRAMS</td><td class="left">C:\Documents and Settings\username\Start Menu\Programs</td></tr>
<tr><td class="left">RESOURCES</td><td class="left">%windir%\Resources\, For theme and other windows resources.</td></tr>
<tr><td class="left">STARTMENU</td><td class="left">C:\Documents and Settings\username\Start Menu</td></tr>
<tr><td class="left">STARTUP</td><td class="left">C:\Documents and Settings\username\Start Menu\Programs\Startup.</td></tr>
<tr><td class="left">SYSTEM</td><td class="left">System Directory (usualy C:\WINDOWS\System32)</td></tr>
<tr><td class="left">WINDOWS</td><td class="left">Windows Directory (usualy c:\Windows)</td></tr>
</tbody>
</table>


<p>
TC NOTE: Not all above pseudovariables are currently supported but they may be in the future versions.
</p>

</div>

</div>
