FavMenu.org
** MENU EDITOR FEATURES

Menu Editor is separate application that can be used to edit & organise the menu. If you already
have Config.ini created by FavMenu it will use existing configuration. If you don¡¯t use FavMenu,
Menu Editor will try to find wincmd.ini or ask you on failure.

Although you can use other available TC editors together with Favmenu it is not recommended since
they are not aware of the icons. This connection may be even havier in the future.

If you want to edit single item the fastest way is to use FavMenu¡¯s itegrated Properties dialog
(CTRL ENTER).  Editor can be added at the end of the Favmenu menu via its Setup dialog.

- SHIFT Up/Down 

  Move an item, or entire submenu. 

  While moving, when you encounter submenu, if it is expanded, current item will become its child or
  will be removed from it.  Otherwise, item will jump over the submenu.

- F2

  Change the title of an item. Use & to set a shortcut and ¨C to specify separator.

- ENTER

  This key will redirect you to the next editable field for current item.

- INSERT | SHIFT INSERT

  Press insert to add new menu item after currently selected. Hold shift to insert new submenu.

  When the last item of the submenu is deleted, submenu will be turned to simple menu item. 

- DELETE

  Remove the item or complete submenu.

- Browse buttons

  >> buttons can be used to speed up editing.

  If the first word in the command field is ¡°cd¡±, browse for directory dialog will be displayed,
  otherwise, browse for file. You must still press ENTER to save changes.
  
- Settings

  If settings tab in Menu Editor is hidden, use CTRL TAB to select it. You can change the look and
  behavior of the editor here.

*** NOTES

You may encounter some problems related to Total Commander interaction with the menu. It is the best
to avoid using TC editor at all, since FavMenu Editor is much faster and functional plus TC editor
will delete menu information about your icons if you set them. You can use ¡°Add current dir¡± TC
option without any problems.

- If you have empty sub menus, script will not work.

- If you have 2 submenu items with the same name, in order to see the second one, you must add
  pseudospace (ALT 0160) at the end of the title of the second one. For all subsequent items with
  the same name add additional pseudospace. Having enteries with the same name in the same submenu
  will present some bugs with icons if you use them.

- Menu is collected from the wincmd.ini [DirMenu] section. Format of this menu is:

#+begin_example
	  menuN =  title | - | -title | -- 
	  cmdN  =  cd <path|plugin|pseudovarialbe> | executable
#+end_example
	  
  While building the menu, section will be iterated sequentially up to the first menuX item that
  doesn't exist. If, for some reason, your TC menu has "hole" in a sequence, script will rise errors
  or will not display the complete menu.  This menu, for instance will not work:

#+begin_example
	  [DirMenu]
	  menu1=item1
	  menu2=item2
	  menu4=item3
#+end_example

  To make sure your menu is not messed-up, open TC Favorites configuration and click OK button. TC
  will rebuild the menu sequentially. If you still have problems, delete everything (backup
  wincmd.ini first) and create your menu again. And if you still have problems (very unlikely),
  visit developing forum to report this. If you have any other mistakes in menu syntax script will
  not work.

- Win9x systems are not and will not be tested. If it works, cool, but if not,  don't ask for support.

- You can setup Win key shortcuts by manualy editing Config.ini : Edit =tcKey= value in =TCFavMenu=
  section. U can set =Lwin= or =Rwin= or #letter.

  Example: 
    * =#A= - shortcut definition for Win + A so entery in Config.ini should be in this case: =tcKey\=#a= 
    * =Lwin= - shortcut definition for solo left Windows key

- You can set hotkey for famenu to be mouse button by editing configuration file.  Set tcKey in
  TCFavMenu section to Mbutton or Rbutton as desired

- Total Commander compatibility issues:
  
  FTP and internal commands in menu supported by TC are not currently supported by Favmenu.  Target
  field supported by TC is not currently supported by Favmenu (seems nobody need this)

** SCRIPT MERGING

If you are AutoHotKey user, you can include Favmenu and Editor in you own scripts.
This is an example:

#+begin_example

	g := 1
	SetWorkingDir <path to Favmenu>
	g := FavMenu_Init(g, "FavMenuSubmenu", false)
	g := Editor_Init(g, ¡°¡±, false)

	Menu, Tray, Add, FavMenu :FavMenuSubmenu
Return


#Include <path to Favmenu & Editor>
#Include FavMenu.ahk
#Include Editor.ahk
#+end_example

Init functions must be called in your autorun section to initialise scripts. Parameters are:

  * ByRef Param1 :: last GUI number used. This is automatically, just set the g to 1 and add g as a
                    first parameter in every next Init function call. Function will return new gui
                    number incremented with the count of GUIs used in the script
  * Tray submenu :: Since you can run several scripts together, you set here the Tray submenu that
                   	script will use for its own menu enteries. After that, add it in the tray with
                   	the Menu command. If you leave this parameter empty, the menu will be added to
                   	the Tray itself.  
  * Standalone :: Set this to false. This flag notifies the script that it is not used standalone
                   	but as a part of merged environment.

From this point you can use following functions:

#+begin_example
		FavMenu_Create()		Show the FavMenu. 
		Editor_Run()			Starts the editor	
		
		FavMenu_Options_*		set ini option, replace * with ini value from [TCFavMenu] section
		Editor_Options_*		set ini option, replace * with ini value from [Editor] section
#+end_example
	
For instance, this will set Win + P to show FavMenu at the mouse position and Win + N to show the Editor:

#+begin_example

	#p:
		t := FavMenu_Options_MenuPos		;save current option
		FavMenu_Options_MenuPos := 1		;mouse postion
		FavMenu_Create()				;show the menu
		FavMenu_Options_MenuPos := t		;restore saved option
	Return

	#n:
		Editor_Run()
	return
				
#+end_example

If you want to know more about script merging see my article:
[[http://www.r-moth.com/code/Autohotkey_Article.htm][Autohotkey: Constructive Language Criticism & Script Merging]]
	
	
** HISTORY:

