FavMenu.html

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4">MENU EDITOR FEATURES </h3>
<div class="outline-text-3" id="text-1_4">


<p>
Menu Editor is separate application that can be used to edit &amp; organise the menu. If you already
have Config.ini created by FavMenu it will use existing configuration. If you don¡¯t use FavMenu,
Menu Editor will try to find wincmd.ini or ask you on failure.
</p>
<p>
Although you can use other available TC editors together with Favmenu it is not recommended since
they are not aware of the icons. This connection may be even havier in the future.
</p>
<p>
If you want to edit single item the fastest way is to use FavMenu¡¯s itegrated Properties dialog
(CTRL ENTER).  Editor can be added at the end of the Favmenu menu via its Setup dialog.
</p>
<ul>
<li>
SHIFT Up/Down 

<p>
Move an item, or entire submenu. 
</p>
<p>
While moving, when you encounter submenu, if it is expanded, current item will become its child or
will be removed from it.  Otherwise, item will jump over the submenu.
</p>
</li>
<li>
F2

<p>
Change the title of an item. Use &amp; to set a shortcut and ¨C to specify separator.
</p>
</li>
<li>
ENTER

<p>
This key will redirect you to the next editable field for current item.
</p>
</li>
<li>
INSERT | SHIFT INSERT

<p>
Press insert to add new menu item after currently selected. Hold shift to insert new submenu.
</p>
<p>
When the last item of the submenu is deleted, submenu will be turned to simple menu item. 
</p>
</li>
<li>
DELETE

<p>
Remove the item or complete submenu.
</p>
</li>
<li>
Browse buttons

<p>
&gt;&gt; buttons can be used to speed up editing.
</p>
<p>
If the first word in the command field is ¡°cd¡±, browse for directory dialog will be displayed,
otherwise, browse for file. You must still press ENTER to save changes.
</p>
</li>
<li>
Settings

<p>
If settings tab in Menu Editor is hidden, use CTRL TAB to select it. You can change the look and
behavior of the editor here.
</p></li>
</ul>



</div>

<div id="outline-container-1_4_1" class="outline-4">
<h4 id="sec-1_4_1">NOTES </h4>
<div class="outline-text-4" id="text-1_4_1">


<p>
You may encounter some problems related to Total Commander interaction with the menu. It is the best
to avoid using TC editor at all, since FavMenu Editor is much faster and functional plus TC editor
will delete menu information about your icons if you set them. You can use ¡°Add current dir¡± TC
option without any problems.
</p>
<ul>
<li>
If you have empty sub menus, script will not work.

</li>
<li>
If you have 2 submenu items with the same name, in order to see the second one, you must add
pseudospace (ALT 0160) at the end of the title of the second one. For all subsequent items with
the same name add additional pseudospace. Having enteries with the same name in the same submenu
will present some bugs with icons if you use them.

</li>
<li>
Menu is collected from the wincmd.ini [DirMenu] section. Format of this menu is:
</li>
</ul>





<pre class="example">menuN =  title | - | -title | -- 
cmdN  =  cd &lt;path|plugin|pseudovarialbe&gt; | executable
</pre>



<p>
While building the menu, section will be iterated sequentially up to the first menuX item that
doesn't exist. If, for some reason, your TC menu has "hole" in a sequence, script will rise errors
or will not display the complete menu.  This menu, for instance will not work:
</p>



<pre class="example">[DirMenu]
menu1=item1
menu2=item2
menu4=item3
</pre>



<p>
To make sure your menu is not messed-up, open TC Favorites configuration and click OK button. TC
will rebuild the menu sequentially. If you still have problems, delete everything (backup
wincmd.ini first) and create your menu again. And if you still have problems (very unlikely),
visit developing forum to report this. If you have any other mistakes in menu syntax script will
not work.
</p>
<ul>
<li>
Win9x systems are not and will not be tested. If it works, cool, but if not,  don't ask for support.

</li>
<li>
You can setup Win key shortcuts by manualy editing Config.ini : Edit <code>tcKey</code> value in <code>TCFavMenu</code>
section. U can set <code>Lwin</code> or <code>Rwin</code> or #letter.

<p>
Example: 
</p><ul>
<li>
<code>#A</code> - shortcut definition for Win + A so entery in Config.ini should be in this case: <code>tcKey\=#a</code> 
</li>
<li>
<code>Lwin</code> - shortcut definition for solo left Windows key

</li>
</ul>
</li>
<li>
You can set hotkey for famenu to be mouse button by editing configuration file.  Set tcKey in
TCFavMenu section to Mbutton or Rbutton as desired

</li>
<li>
Total Commander compatibility issues:

<p>
FTP and internal commands in menu supported by TC are not currently supported by Favmenu.  Target
field supported by TC is not currently supported by Favmenu (seems nobody need this)
</p></li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1_5" class="outline-3">
<h3 id="sec-1_5">SCRIPT MERGING </h3>
<div class="outline-text-3" id="text-1_5">


<p>
If you are AutoHotKey user, you can include Favmenu and Editor in you own scripts.
This is an example:
</p>



<pre class="example">
    g := 1
    SetWorkingDir &lt;path to Favmenu&gt;
    g := FavMenu_Init(g, "FavMenuSubmenu", false)
    g := Editor_Init(g, ¡°¡±, false)

    Menu, Tray, Add, FavMenu :FavMenuSubmenu
Return


#Include &lt;path to Favmenu &amp; Editor&gt;
#Include FavMenu.ahk
#Include Editor.ahk
</pre>



<p>
Init functions must be called in your autorun section to initialise scripts. Parameters are:
</p>
<dl>
<dt>ByRef Param1</dt><dd>
last GUI number used. This is automatically, just set the g to 1 and add g as a
first parameter in every next Init function call. Function will return new gui
number incremented with the count of GUIs used in the script
</dd>
<dt>Tray submenu</dt><dd>
Since you can run several scripts together, you set here the Tray submenu that
script will use for its own menu enteries. After that, add it in the tray with
the Menu command. If you leave this parameter empty, the menu will be added to
the Tray itself.  
</dd>
<dt>Standalone</dt><dd>
Set this to false. This flag notifies the script that it is not used standalone
but as a part of merged environment.
</dd>
</dl>


<p>
From this point you can use following functions:
</p>



<pre class="example">FavMenu_Create()        Show the FavMenu. 
Editor_Run()            Starts the editor   

FavMenu_Options_*       set ini option, replace * with ini value from [TCFavMenu] section
Editor_Options_*        set ini option, replace * with ini value from [Editor] section
</pre>



<p>
For instance, this will set Win + P to show FavMenu at the mouse position and Win + N to show the Editor:
</p>



<pre class="example">
#p:
    t := FavMenu_Options_MenuPos        ;save current option
    FavMenu_Options_MenuPos := 1        ;mouse postion
    FavMenu_Create()                ;show the menu
    FavMenu_Options_MenuPos := t        ;restore saved option
Return

#n:
    Editor_Run()
return
            
</pre>



<p>
If you want to know more about script merging see my article:
<a href="http://www.r-moth.com/code/Autohotkey_Article.htm">Autohotkey: Constructive Language Criticism &amp; Script Merging</a>
</p>

</div>

</div>
