FavMenu.html

<div id="outline-container-1_6" class="outline-3">
<h3 id="sec-1_6">HISTORY: </h3>
<div class="outline-text-3" id="text-1_6">



</div>

<div id="outline-container-1_6_1" class="outline-4">
<h4 id="sec-1_6_1">V2.0 (18. September 2006) </h4>
<div class="outline-text-4" id="text-1_6_1">

<ul>
<li>
Added support for Browse For Folders dialogs (might need administrator privilegies)
</li>
<li>
Added support for Console ( internal console commands are also supported ).
</li>
<li>
Added support for Windows Explorer (you can use it also as a File Manager instead of Total
Commander)
</li>
<li>
Added left click on the tray icon to launch FavMenu from the tray.
</li>
<li>
Clicking on tray icon will not steal current focus. This means that you can use Favmenu within
supported windows via the tray icon.
</li>
<li>
Added custom tray icons for enabled and dissabled state. You can change them in res folder.
</li>
<li>
Enhaced ¡°Add current directory¡± feature:
<ul>
<li>
Now supports Browse For Folders, Windows Explorer and Console.
</li>
<li>
Full functionality in Open/Save standard dialogs: support for all folders including virtual
folders with physical representation.  (Desktop, My Picture, My Documents, Recent
Documents¡­)
</li>
<li>
Dialog is now of dynamic width: the path recognised will always fit except if it is too long
</li>
</ul>
</li>
<li>
Added Help tray menu item
</li>
<li>
Properties: Added ¡°change item¡± button.  Click on it to select next item to edit, via FavMenu.
</li>
<li>
Properties: Added ENTER key handling. Pressing it will switch focus to next item parameter.
</li>
<li>
Setup: New options ¨C integration tab ¨C select where do you want Favmenu to appear.
</li>
<li>
Setup: Added button to create sample menu.
</li>
<li>
Editor: changed Enter key behavior - it is no longer needed in Editor to press Enter on every
changed item.
</li>
<li>
Items are saved per keypress. Everything is saved after Save button is pressed.

</li>
</ul>

</div>

</div>

<div id="outline-container-1_6_2" class="outline-4">
<h4 id="sec-1_6_2">V1.1 (21. Avgust 2006) </h4>
<div class="outline-text-4" id="text-1_6_2">

<ul>
<li>
Add current directory is available in dialogs also (except Office dialogs). Previous version had
this item only if TC was active. It will surely work for hard disk folders and My Documents
virtual folder. It doesn¡¯t work for Desktop.
</li>
<li>
CTRL SHIFT ENTER on menu item will paste that item in active window.
</li>
<li>
Dialog handling improvements and bug fixes. Sometimes you could get redirected to TC when using
Favmenu in dialogs without a reason.
</li>
<li>
Added Total Commander hook to ¡°Current Directory¡± header: double click on it will open Favmenu
preventing original TC menu. [*] button is not hooked.
</li>
<li>
Properties: when open, using FavMenu will switch the Properties view to that item thus making
editing of particular item much faster.

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1_7" class="outline-3">
<h3 id="sec-1_7">TO DO </h3>
<div class="outline-text-3" id="text-1_7">

<ul>
<li>
Smart refreshing (menu is now refreshed on every call witch is slow for menus with 150+ items,
depending on computer speed).  Highest priority.
</li>
<li>
FTP user name &amp; password in menu command.
</li>
<li>
TC internal commands (like cm_opendrives etc..)
</li>
<li>
Command line option: specify configuration file to use for both applications.
</li>
<li>
Hook for * button in TC
</li>
<li>
Icon for famenu within dialogs
</li>
<li>
Large icons
</li>
</ul>


</div>

</div>

<div id="outline-container-1_8" class="outline-3">
<h3 id="sec-1_8">ABOUT </h3>
<div class="outline-text-3" id="text-1_8">


<p>
Created by Miodrag Milic 
in AutoHotKey &lt;www.autohotkey.com&gt;
using Windows XP Pro
</p>

<p>
e-mail:     miodrag.milic@gmail.com
homepage:   code.r-moth.com  |  www.r-moth.com   |  r-moth.deviantart.com
</p>
<p>
Belgrade, Jun 2006
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: 
</p>
<p class="date"> Date: 2013-02-05 22:06:57 </p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
